{
  "backend/main.mo": "Defines a Book type, stores a list of Honeydew textbook entries, and exposes a query to return them.",
  "feature_evidence.json": "Placeholder feature evidence report with an empty features array.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for key frontend files including styles, routing, components, and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light/dark modes and applying global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with landing and reader routes wrapped in a shared layout.",
  "frontend/src/components/BookCard.tsx": "Displays a book card with normalized cover image paths and a button routing to the reader page.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides global page layout with header, footer, and content wrapper.",
  "frontend/src/constants/books.ts": "Empty constants file intended for book‑related configuration.",
  "frontend/src/constants/honeydewChapters.ts": "Exports a structured chapter index for the Honeydew textbook with titles and starting pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBooks.ts": "Fetches the book list from the backend actor with controlled retry and refetch behavior.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, login handling, and identity persistence.",
  "frontend/src/index.css": "Tailwind stylesheet defining a warm educational OKLCH palette and global typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentity providers before rendering App.",
  "frontend/src/pages/LandingPage.tsx": "Displays a hero section and a list of available books with loading/error states and basic feature cards.",
  "frontend/src/pages/ReaderPage.tsx": "Loads and displays a selected book’s PDF with chapter navigation, search, and iframe load-state handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugin integrations.",
  "project_state.json": "Tracks project state, issues, and feature requests related to adding missing Honeydew PDF assets."
}