{
  "backend/main.mo": "Defines a Book type, stores a single Honeydew book, and exposes a query to return the book list.",
  "feature_evidence.json": "Lists feature evidence entries mapping product features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Human‑written summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base/theme setup defining color variables and dark mode styles.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing and reader pages inside a shared layout.",
  "frontend/src/components/BookCard.tsx": "Book card UI displaying book details with a button that navigates to the reader page.",
  "frontend/src/components/layout/SiteLayout.tsx": "Shared layout providing header, footer, and content wrapper for all pages.",
  "frontend/src/constants/books.ts": "Empty placeholder file intended for book-related constants.",
  "frontend/src/constants/honeydewChapters.ts": "Exports the Honeydew chapter list with titles and starting pages.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useBooks.ts": "React Query hook fetching books from the backend with limited retries and disabled auto‑refetch.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Tailwind-based global styles defining a warm educational color system and typography rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/LandingPage.tsx": "Displays the landing page with a hero banner, book list fetched via useBooks, loading/error states, and feature highlights.",
  "frontend/src/pages/ReaderPage.tsx": "Renders a PDF reader with chapter navigation, search, loading/error handling, and iframe-based PDF display for a selected book.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, container settings, and includes typography and animation plugins.",
  "project_state.json": "Defines the project’s state, requirements, known issues, and feature requests related to improving PDF loading and direct-open capabilities."
}